rkalyan95/stm32_ll_drivers/stm32_ll_flash/src/stm32_ll_flash.c
#include <stm32l433xx.h>
#include "stm32_ll_flash.h"
#include "common.h"

/**
 * @brief Naive line chunk processing.
 * 
 * This function is responsible for handling line chunk processing
 * in a naive manner. It serves as an introductory implementation
 * for understanding basic line processing operations.
 * 
 * Note: The implementation may not be optimized for performance.
 * 
 * @warning Ensure that all necessary preconditions are met before
 * calling this function.
 */


static inline void ClearAllErrors(void)
{
    ((GetErrorInfo(EOP_ST)==1)?SetErrorInfo(EOP_ST):0);
    ((GetErrorInfo(OPERR_ST)==1)?SetErrorInfo(OPERR_ST):0);
    ((GetErrorInfo(PROGERR_ST)==1)?SetErrorInfo(PROGERR_ST):0);
    ((GetErrorInfo(WRPERR_ST)==1)?SetErrorInfo(WRPERR_ST):0);
    ((GetErrorInfo(PAGE_ALIGN_ST)==1)?SetErrorInfo(PAGE_ALIGN_ST):0);
    ((GetErrorInfo(SIZE_ERR_ST)==1)?SetErrorInfo(SIZE_ERR_ST):0);
    ((GetErrorInfo(PROG_SEQ_ERR_ST)==1)?SetErrorInfo(PROG_SEQ_ERR_ST):0);
    ((GetErrorInfo(FASTPROG_DMISS_ERR_ST)==1)?SetErrorInfo(FASTPROG_DMISS_ERR_ST):0);
    ((GetErrorInfo(FASTPROG_ERR_ST)==1)?SetErrorInfo(FASTPROG_ERR_ST):0);
    ((GetErrorInfo(PCROP_READ_ERR_ST)==1)?SetErrorInfo(PCROP_READ_ERR_ST):0);

}

/**
 * @brief Unlock or lock the option register sequence.
 * 
 * This function handles the unlocking and locking of the option register.
 * If the lock parameter is true, the function unlocks the option register
 * through a key sequence. Otherwise, it waits for the busy bit to clear,
 * clears all errors, and locks the option register by enabling the lock.
 * 
 * @param lock A boolean value to indicate lock status. 
 *             - true: Unlock the option register.
 *             - false: Lock the option register.
 * 
 * @note Ensure that necessary preconditions are met before calling this function.
 */

static inline FlashErr_t UnLockSequence(bool Unlock)
{
    uint16_t timeout = 1000;
    //Unlock the opt register by key sequence
    if(Unlock==true)
    {
        UnlockOptReg();
    }
    else
    {
        //Wait for the Busy Bit to become 0
        while(GetErrorInfo(BUSY_ERR)!=0 && timeout-->0);
        if(timeout==0)
        {
            return FLASH_OPR_BUSY;
        }
        ClearAllErrors();
    //lock the opt register by enabling the lock again
        SetFlashCrRegister(OPTLOCK_ENABLED,true);
    }

    return FLASH_OPR_SUCESSS;
    
}
/**
 * @brief Retrieve the current read protection level.
 * 
 * This function retrieves the read protection level from the option register
 * and stores it in the provided memory location. The read protection level
 * determines the security level of the flash memory.
 * 
 * @param[out] ReadProtection Pointer to store the read protection level.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 * 
 * @note Ensure that the pointer provided is valid and that the function is 
 *       called in a context where accessing the option register is safe.
 */



FlashErr_t GetReadProtection(uint8_t *ReadProtection)
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;
    *ReadProtection = GET_BITS(FLASH->OPTR,FLASH_OPTR_RDP_Pos,8);
    RetCode = FLASH_OPR_SUCESSS;
    return RetCode;
}
/**
 * @brief Set the read protection level.
 * 
 * This function sets the read protection level in the option register. The
 * read protection level determines the security level of the flash memory.
 * 
 * @param[in] ReadProtection Read protection level to set.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 * 
 * @note Ensure that the pointer provided is valid and that the function is 
 *       called in a context where accessing the option register is safe.
 */
FlashErr_t SetReadProtection(uint8_t ReadProtection)
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;
    SET_BITS(FLASH->OPTR,FLASH_OPTR_RDP_Pos,8,ReadProtection);
    RetCode = (GET_BITS(FLASH->OPTR,FLASH_OPTR_RDP_Pos,8)==ReadProtection);
    return RetCode;
}


/**
 * @brief Get the BOR reset level.
 * 
 * This function retrieves the level of the brown-out reset (BOR) from the
 * option register and stores it in the provided memory location. The BOR
 * is a reset caused by a failure in the power supply.
 * 
 * @param[out] BorLvl Pointer to store the brown-out reset level. The value
 *                    will be in the range 0 to 7, where 0 is the lowest
 *                    voltage and 7 is the highest.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 * 
 * @note Ensure that the pointer provided is valid and that the function is 
 *       called in a context where accessing the option register is safe.
 */

FlashErr_t GetBorRstLvl(uint8_t *BorLvl)
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;
    *BorLvl = GET_BITS(FLASH->OPTR,FLASH_OPTR_BOR_LEV_Pos,3);
    RetCode = FLASH_OPR_SUCESSS;
    return RetCode;
}
/**
 * @brief Set the options register settings.
 * 
 * This function sets the options register settings. The options register
 * contains configuration settings such as the read protection level and the
 * brown-out reset (BOR) level.
 * 
 * @param[in] OptrReg Options register setting to set.
 * @param[in] En      Setting value to set. If En is true the setting is
 *                    enabled.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 * 
 * @note Ensure that the option register is unlocked before calling this
 *       function.
 */
FlashErr_t SetOptionsRegisterSettings(OptionsReg_t OptrReg,bool En)
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;
    if(OptrReg>=nRST_STOP)
    {
        UnLockSequence(true);
        SET_BITS(FLASH->OPTR,OptrReg,1,En);
        RetCode = (GET_BITS(FLASH->OPTR,OptrReg,1)==En)?FLASH_OPR_SUCESSS:FLASH_OPR_FAILED;
        RetCode = UnLockSequence(false);
    }

    return RetCode;
}
/**
 * @brief Retrieve the PCROP region.
 * 
 * This function retrieves the start and end address of the PCROP region
 * from the option register and stores it in the provided memory locations.
 * The PCROP region is a region of the flash memory that has been protected
 * against writing.
 * 
 * @param[out] PcorpStart Pointer to store the start address of the PCROP region.
 * @param[out] PcorpEnd   Pointer to store the end address of the PCROP region.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 * 
 * @note Ensure that the pointers provided are valid and that the function is 
 *       called in a context where accessing the option register is safe.
 */
FlashErr_t GetPcropRange(uint16_t *PcorpStart,uint16_t *PcorpEnd)  
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;
    *PcorpStart = GET_BITS(FLASH->PCROP1SR,FLASH_PCROP1SR_PCROP1_STRT_Pos,16);
    *PcorpEnd = GET_BITS(FLASH->PCROP1ER,FLASH_PCROP1ER_PCROP1_END_Pos,16);
    RetCode = FLASH_OPR_SUCESSS;
    return RetCode;
}
/**
 * @brief Set the PCROP region.
 * 
 * This function sets the start and end address of the PCROP region
 * in the option register. The PCROP region is a region of the flash
 * memory that has been protected against writing.
 * 
 * @param[in] PcorpStart Start address of the PCROP region.
 * @param[in] PcorpEnd   End address of the PCROP region.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 * 
 * @note Ensure that the pointers provided are valid and that the function is 
 *       called in a context where accessing the option register is safe.
 */
FlashErr_t SetPcropRange(uint16_t *PcorpStart,uint16_t *PcorpEnd)  
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;
    
    UnLockSequence(true);

    SET_BITS(FLASH->PCROP1SR,FLASH_PCROP1SR_PCROP1_STRT_Pos,16,*PcorpStart);
    SET_BITS(FLASH->PCROP1ER,FLASH_PCROP1ER_PCROP1_END_Pos,16,*PcorpEnd);
    SetFlashCrRegister(OPT_MODIFY_STRT,true);

    RetCode = UnLockSequence(false);
    return RetCode;

