rkalyan95/stm32_ll_drivers/stm32_ll_flash/src/stm32_ll_flash.c
}
/**
 * @brief Get the write protection for area A.
 * 
 * This function retrieves the start and end address of the write protection
 * area A from the option register and stores it in the provided memory
 * locations.
 * 
 * @param[out] WrpStart Pointer to store the start address of the write
 *                     protection area A.
 * @param[out] WrpEnd   Pointer to store the end address of the write
 *                     protection area A.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 * 
 * @note Ensure that the pointers provided are valid and that the function is 
 *       called in a context where accessing the option register is safe.
 */
FlashErr_t GetWriteProtAreaA(uint8_t *WrpStart , uint8_t *WrpEnd)
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;
    *WrpStart = GET_BITS(FLASH->WRP1AR,FLASH_WRP1AR_WRP1A_STRT_Pos,8);
    *WrpEnd = GET_BITS(FLASH->WRP1AR,FLASH_WRP1AR_WRP1A_END_Pos,8);
    RetCode = FLASH_OPR_SUCESSS;
    return RetCode;
}
/**
 * @brief Get the write protection for area A.
 * 
 * This function retrieves the start and end address of the write protection
 * area A from the option register and stores it in the provided memory
 * locations.
 * 
 * @param[out] WrpStart Pointer to store the start address of the write
 *                      protection area A.
 * @param[out] WrpEnd   Pointer to store the end address of the write
 *                      protection area A.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 *         - FLASH_OPR_FAILED: Operation failed.
 * 
 * @note Ensure that the pointers provided are valid and that the function is 
 *       called in a context where accessing the option register is safe.
 */

FlashErr_t SetWriteProtAreaA(uint8_t *WrpStart , uint8_t *WrpEnd)
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;

    //Unlock the opt register by key sequence
    UnLockSequence(true);
    SET_BITS(FLASH->WRP1AR,FLASH_WRP1AR_WRP1A_STRT_Pos,8,*WrpStart);
    SET_BITS(FLASH->WRP1AR,FLASH_WRP1AR_WRP1A_END_Pos,8,*WrpEnd);
    SetFlashCrRegister(OPT_MODIFY_STRT,true);
    RetCode = UnLockSequence(false);

    return RetCode;
}

/**
 * @brief Retrieve the write protection for area B.
 * 
 * This function retrieves the start and end address of the write protection
 * area B from the option register and stores it in the provided memory
 * locations.
 * 
 * @param[out] WrpStart Pointer to store the start address of the write
 *                      protection area B.
 * @param[out] WrpEnd   Pointer to store the end address of the write
 *                      protection area B.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 *         - FLASH_OPR_FAILED: Operation failed.
 * 
 * @note Ensure that the pointers provided are valid and that the function is 
 *       called in a context where accessing the option register is safe.
 */
FlashErr_t GetWriteProtAreaB(uint8_t *WrpStart , uint8_t *WrpEnd)
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;
    *WrpStart = GET_BITS(FLASH->WRP1BR,FLASH_WRP1BR_WRP1B_STRT_Pos,8);
    *WrpEnd = GET_BITS(FLASH->WRP1BR,FLASH_WRP1BR_WRP1B_END_Pos,8);
    RetCode = FLASH_OPR_SUCESSS;
    return RetCode;
}
/**
 * @brief Set the write protection for area B.
 * 
 * This function sets the start and end address of the write protection area B
 * in the option register.
 * 
 * @param[out] WrpStart Pointer to store the start address of the write
 *                      protection area B.
 * @param[out] WrpEnd   Pointer to store the end address of the write
 *                      protection area B.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: Operation was successful.
 *         - FLASH_OPR_FAILED: Operation failed.
 * 
 * @note Ensure that the pointers provided are valid and that the function is 
 *       called in a context where accessing the option register is safe.
 */
FlashErr_t SetWriteProtAreaB(uint8_t *WrpStart , uint8_t *WrpEnd)
{
    FlashErr_t RetCode=FLASH_OPR_FAILED;
    //Unlock the opt register by key sequence
    UnLockSequence(true);
    SET_BITS(FLASH->WRP1BR,FLASH_WRP1BR_WRP1B_STRT_Pos,8,*WrpStart);
    SET_BITS(FLASH->WRP1BR,FLASH_WRP1BR_WRP1B_END_Pos,8,*WrpEnd);
    SetFlashCrRegister(OPT_MODIFY_STRT,true);
    RetCode = UnLockSequence(false);
    return RetCode;
}
/**
 * @brief Set the flash latency.
 * 
 * This function sets the flash latency by configuring the appropriate bits in the
 * Access Control Register (ACR) of the flash memory.
 * 
 * @param[in] FlashLat The desired flash latency level of type FlashLatency_t.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the latency was set successfully.
 *         - FLASH_OPR_FAILED: If setting the latency failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */

FlashErr_t SetFlashLatency(FlashLatency_t FlashLat)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;;

    while(GetErrorInfo(BUSY_ERR)!=0);

    SET_BITS(FLASH->ACR,FLASH_ACR_LATENCY_Pos,2,FlashLat);
    RetCode = (GET_BITS(FLASH->ACR,FLASH_ACR_LATENCY_Pos,2)==FlashLat);
    return RetCode;
}

/**
 * @brief Configure the flash memory with the desired configuration.
 * 
 * This function can be used to set the flash memory to the desired
 * configuration. The configuration can be one of the following:
 * - FLASH_CONF_DEFAULT: The default configuration.
 * - FLASH_CONF_I_CACHE: The instruction cache is enabled.
 * - FLASH_CONF_D_CACHE: The data cache is enabled.
 * - FLASH_CONF_PREFETCH: The prefetch cache is enabled.
 * - FLASH_CONF_I_CACHE_D_CACHE: The instruction cache and the data cache are
 *                               enabled.
 * - FLASH_CONF_PREFETCH_I_CACHE: The prefetch cache and the instruction cache
 *                                are enabled.
 * - FLASH_CONF_PREFETCH_D_CACHE: The prefetch cache and the data cache are
 *                                enabled.
 * - FLASH_CONF_PREFETCH_I_CACHE_D_CACHE: The prefetch cache, the instruction
 *                                        cache and the data cache are enabled.
 * 
 * @param[in] Config The desired configuration of type FlashConfig_t.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the configuration was set successfully.
 *         - FLASH_OPR_FAILED: If setting the configuration failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */
FlashErr_t SetPreFetchCache(bool IPre , bool Icache , bool Dcache)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;;
    SET_BITS(FLASH->ACR,FLASH_ACR_PRFTEN_Pos,1,IPre);
    SET_BITS(FLASH->ACR,FLASH_ACR_ICEN_Pos,1,Icache);
    SET_BITS(FLASH->ACR,FLASH_ACR_DCEN_Pos,1,Dcache);
    RetCode = (GET_BITS(FLASH->ACR,FLASH_ACR_PRFTEN_Pos,1)==IPre) && (GET_BITS(FLASH->ACR,FLASH_ACR_ICEN_Pos,1)==Icache) && (GET_BITS(FLASH->ACR,FLASH_ACR_DCEN_Pos,1)==Dcache);
    return RetCode;
}
/**
 * @brief Enable or disable the reset of the instruction and data caches.
 * 
 * This function can be used to enable or disable the reset of the instruction
 * and data caches. The reset is only enabled if the instruction and data caches
 * are enabled.
 * 
 * @param[in] DCacheRst true to enable the reset of the data cache, otherwise false.
 * @param[in] ICacheRst true to enable the reset of the instruction cache, otherwise false.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the configuration was set successfully.
 *         - FLASH_OPR_FAILED: If setting the configuration failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */
FlashErr_t EnableDataInstructionReset(bool DCacheRst , bool ICacheRst)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;;
    if((!GET(FLASH->ACR,FLASH_ACR_DCEN_Pos))&& (!GET(FLASH->ACR,FLASH_ACR_ICEN_Pos)))
    {
        SET_BITS(FLASH->ACR,FLASH_ACR_DCRST_Pos,1,DCacheRst);
        SET_BITS(FLASH->ACR,FLASH_ACR_ICRST_Pos,1,ICacheRst);
        RetCode = (GET_BITS(FLASH->ACR,FLASH_ACR_DCRST_Pos,1)==0) && (GET_BITS(FLASH->ACR,FLASH_ACR_ICRST_Pos,1)==0);
    }
    else
    {
        RetCode = FLASH_OPR_FAILED;
    }

    return RetCode;
}

/**
 * @brief Enable or disable the reset of the instruction and data caches on power down.
 * 
 * This function can be used to enable or disable the reset of the instruction
 * and data caches when the device is powered down. The reset is only enabled if
 * the instruction and data caches are enabled.
 * 
 * @param[in] Sleep true to enable the reset of the instruction and data caches
 *                  when the device is in sleep mode, otherwise false.
 * @param[in] PwrDwn true to enable the reset of the instruction and data caches
 *                  when the device is powered down, otherwise false.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the configuration was set successfully.
 *         - FLASH_OPR_FAILED: If setting the configuration failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */

FlashErr_t ConfigureSlpPwrDwn(bool Sleep , bool PwrDwn)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;;
    SET_BITS(FLASH->ACR,FLASH_ACR_SLEEP_PD_Pos,1,Sleep);
    SET_BITS(FLASH->ACR,FLASH_ACR_RUN_PD_Pos,1,PwrDwn);
    RetCode = (GET_BITS(FLASH->ACR,FLASH_ACR_SLEEP_PD_Pos,1)==Sleep) && (GET_BITS(FLASH->ACR,FLASH_ACR_RUN_PD_Pos,1)==PwrDwn);
    return RetCode;
}

/**
 * @brief Unlock the power down register for programming.
 * 
 * This function unlocks the power down register for programming. The unlock
 * sequence must be performed in the exact order as specified in the
 * datasheet.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the unlock sequence was successful.
 *         - FLASH_OPR_FAILED: If the unlock sequence failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */
FlashErr_t UnlockFlashPwrDwnSeq(void)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;
    SET_BITS(FLASH->KEYR,0,32,PDKEY1);
    SET_BITS(FLASH->KEYR,0,32,PDKEY2);

