rkalyan95/stm32_ll_drivers/stm32_ll_flash/src/stm32_ll_flash.c
    RetCode = FLASH_OPR_SUCESSS;
    return RetCode;
}

/**
 * @brief Lock the power down register for programming.
 * 
 * This function locks the power down register for programming. The lock
 * sequence must be performed in the exact order as specified in the
 * datasheet.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the lock sequence was successful.
 *         - FLASH_OPR_FAILED: If the lock sequence failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */
FlashErr_t UnlockOptReg(void)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;
    SET_BITS(FLASH->OPTKEYR,0,32,0x08192A3B);
    SET_BITS(FLASH->OPTKEYR,0,32,0x4C5D6E7F);
    RetCode = FLASH_OPR_SUCESSS;
    return RetCode;
}

/**
 * @brief Set the error information for the flash.
 * 
 * This function sets the error information for the flash. The error
 * information is used to indicate the type of error that occurred.
 * 
 * @param[in] FlashStatus The status of the flash.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the operation was successful.
 *         - FLASH_OPR_FAILED: If the operation failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */

FlashErr_t SetErrorInfo(FlashStatus_t FlashStatus)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;

    SET(FLASH->SR,FlashStatus);

    RetCode = GET(FLASH->SR,FlashStatus);
    return RetCode;

}
/**
 * @brief Retrieve the error information for the flash.
 * 
 * This function retrieves the error information for the flash. The error
 * information is used to indicate the type of error that occurred.
 * 
 * @param[out] FlashStatus Pointer to store the status of the flash.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the operation was successful.
 *         - FLASH_OPR_FAILED: If the operation failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */
FlashErr_t GetErrorInfo(FlashStatus_t FlashStatus)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;
    RetCode = GET(FLASH->SR,FlashStatus);
    return RetCode;

}

/**
 * @brief Set the flash control register.
 * 
 * This function sets the flash control register with the desired value. The
 * value is a bit field where each bit corresponds to a specific control signal.
 * The control signals are:
 * - FLASH_CR_PNB: Page number bit.
 * - FLASH_CR_BKER: Bank erase bit.
 * - FLASH_CR_MER: Mass erase bit.
 * - FLASH_CR_PER: Page erase bit.
 * - FLASH_CR_STRT: Start bit.
 * - FLASH_CR_LOCK: Lock bit.
 * - FLASH_CR_OBL_LAUNCH: Launch bit for the option byte loading.
 * - FLASH_CR_FSTPG: Fast programming bit.
 * - FLASH_CR_EOPIE: End of operation interrupt enable bit.
 * - FLASH_CR_ERRIE: Error interrupt enable bit.
 * - FLASH_CR_OBL_RDPRT: Option byte loading read protection bit.
 * - FLASH_CR_RDPRT: Read protection bit.
 * - FLASH_CR_WRP: Write protect bit.
 * - FLASH_CR_PNBSTR: Page number bit strap.
 * - FLASH_CR_PNBREL: Page number bit release.
 * - FLASH_CR_OPTSTRT: Option start bit.
 * - FLASH_CR_OPTLOCK: Option lock bit.
 * - FLASH_CR_OPTWIP: Option write in progress bit.
 * - FLASH_CR_BUSY: Busy bit.
 * - FLASH_CR_WRPRT: Write protect bit read.
 * - FLASH_CR_RDP: Read protection bit read.
 * - FLASH_CR_OTP: One time programming bit read.
 * - FLASH_CR_BYP: Boot loader protection bit read.
 * - FLASH_CR_PRG: Programming bit read.
 * - FLASH_CR_EOP: End of operation bit read.
 * - FLASH_CR_WRPRT0: Write protect bit read.
 * - FLASH_CR_WRPRT1: Write protect bit read.
 * - FLASH_CR_WRPRT2: Write protect bit read.
 * - FLASH_CR_WRPRT3: Write protect bit read.
 * 
 * @param[in] FlashCtrl The desired value for the flash control register.
 * @param[in] En        true to enable the bit, false to disable it.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the operation was successful.
 *         - FLASH_OPR_FAILED: If the operation failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */
FlashErr_t SetFlashCrRegister(FlashControl_t FlashCtrl, bool En)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;
    if(FlashCtrl<FLASH_CR_PNB_Pos || FlashCtrl > FLASH_CR_PNB_Pos + 7)
    {
        SET_BITS(FLASH->CR,FlashCtrl,1,En);
        RetCode = (GET_BITS(FLASH->CR,FlashCtrl,1)==En);
    }

    
    return RetCode;
    
}

FlashErr_t GetFlashCrRegister(FlashControl_t controlBit)
{
    return GET(FLASH->CR, controlBit); 
}

/**
 * @brief Set the flash page number.
 * 
 * This function sets the flash page number to the desired value. The page
 * number is a bit field where each bit corresponds to a specific page number.
 * 
 * @param[in] PageNum The desired page number.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the operation was successful.
 *         - FLASH_OPR_FAILED: If the operation failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */
FlashErr_t SelectPageNumber(uint8_t PageNum)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;
    SET_BITS(FLASH->CR,FLASH_CR_PNB_Pos,8,PageNum);
    RetCode = (GET_BITS(FLASH->CR,FLASH_CR_PNB_Pos,8)==PageNum);
    return RetCode;
}

/**
 * @brief Retrieve the error address for the ECC.
 * 
 * This function retrieves the address where an ECC error occurred.
 * 
 * @param[out] ecc_address Pointer to store the address of the ECC error.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the operation was successful.
 *         - FLASH_OPR_FAILED: If the operation failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */
FlashErr_t GetErrorAddressEcc(uint32_t *ecc_address)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;
    *ecc_address = GET_BITS(FLASH->ECCR,FLASH_ECCR_ADDR_ECC_Pos,32);
    RetCode = FLASH_OPR_SUCESSS;
    return RetCode;
}

/**
 * @brief Enable or disable the ECC interrupt.
 * 
 * This function enables or disables the ECC interrupt for the specified
 * register.
 * 
 * @param[in] EccReg The ECC register to enable or disable the interrupt for.
 * @param[in] En     true to enable the interrupt, false to disable it.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the operation was successful.
 *         - FLASH_OPR_FAILED: If the operation failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */
FlashErr_t EnableEccInterrupt(EccReg_t EccReg, bool En)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;
    SET_BITS(FLASH->ECCR,EccReg,1,En);
    RetCode = (GET_BITS(FLASH->ECCR,EccReg,1)==En);;
    return RetCode;
}

/**
 * @brief Get ECC correction and detection status.
 * 
 * This function retrieves the status of ECC correction and detection from the
 * flash memory. It provides information on whether an ECC correction or
 * detection event has occurred.
 * 
 * @param[out] EccCorr Pointer to store the ECC correction status. True if an
 *                     ECC correction event occurred, otherwise false.
 * @param[out] EccDet  Pointer to store the ECC detection status. True if an
 *                     ECC detection event occurred, otherwise false.
 * 
 * @return FlashErr_t 
 *         - FLASH_OPR_SUCESSS: If the operation was successful.
 *         - FLASH_OPR_FAILED: If the operation failed.
 * 
 * @note Ensure that the flash is not busy before calling this function.
 */


FlashErr_t GetEccCorrAndDet(bool *EccCorr , bool *EccDet)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;
    *EccCorr = GET_BITS(FLASH->ECCR,FLASH_ECCR_ECCC_Pos,1);
    *EccDet = GET_BITS(FLASH->ECCR,FLASH_ECCR_ECCD_Pos,1);
    RetCode = FLASH_OPR_SUCESSS;
    return RetCode;
}


FlashErr_t FlashErasePage(uint8_t PageNum)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;

    SelectPageNumber(PageNum);

    RetCode = SetFlashCrRegister(PAGE_ERASE_ENABLE,true);
    if(RetCode == FLASH_OPR_SUCESSS)
    {
        SetFlashCrRegister(PAGE_ERASE_ENABLE,true);
        /* Disable the mass erase bit according to datasheet */
        SetFlashCrRegister(MASS_ERASE_ENABLE,false);
        SetFlashCrRegister(START_ERASE,true);
        /*Wait till it is cleared by the flash , no timeout because its flash erase operation*/
        while(GetFlashCrRegister(START_ERASE)!=0);
    }
    return RetCode;

}


FlashErr_t FlashEraseMass(void)
{
    FlashErr_t RetCode = FLASH_OPR_FAILED;

    RetCode = SetFlashCrRegister(MASS_ERASE_ENABLE,true);

    if(RetCode == FLASH_OPR_SUCESSS)
    {

        /* Disable the Page  erase bit according to datasheet */
        SetFlashCrRegister(PAGE_ERASE_ENABLE,false);
        SetFlashCrRegister(START_ERASE,true);
        /*Wait till it is cleared by the flash , no timeout because its flash erase operation*/
        while(GetFlashCrRegister(START_ERASE)!=0);
    }
    return RetCode;
}